// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* RTL toggle */
"UI Is RTL" = "YES";

/* Menus */
"Menu About" = "حول منشئ الصورة في نظام التشغيل Chrome";
"Menu Prefs" = "التفضيلات…";
"Menu Services" = "الخدمات";
"Menu Hide" = "إخفاء منشئ الصورة في نظام التشغيل Chrome";
"Menu Hide Others" = "إخفاء الأخرى";
"Menu Show All" = "إظهار الكل";
"Menu Quit" = "إنهاء منشئ الصورة في نظام التشغيل Chrome";
"Menu Window" = "النافذة";
"Menu Minimize" = "تصغير";
"Menu Zoom" = "تكبير/تصغير";
"Menu Bring All To Front" = "إحضار الكل إلى المقدمة";
"Menu Help" = "مساعدة";
"Menu App Help" = "مساعدة منشئ الصورة في نظام التشغيل Chrome";

/* Buttons */
"Button Previous" = "السابق";
"Button Next" = "التالي";
"Button Stop" = "إيقاف";
"Button Done" = "تم";

/* Tab: Select device model */
"Text Welcome" = "تتيح لك هذه الأداة إنشاء بطاقة SD للاسترداد أو رقاقة ذاكرة USB ، وذلك لاستعادة بيانات جهاز نظام تشغيل Chrome.\n\nأدخل رقم طراز جهاز نظام تشغيل Chrome (مثل SAMS ALEX BETA-US 8738). ويتم عرضه أسفل الشاشة التي تطالبك بتوصيل جهاز للاسترداد.";
"Text Model" = "الطراز:";
"Button Local Image" = "صورة محلية…";

/* Tab: Select USB stick */
"Text Select Prompt" = "تحديد جهاز تخزين قابل للإزالة من أجل الاسترداد:";
"Text Insertion Prompt" = "الرجاء إدخال بطاقة SD أو رقاقة ذاكرة USB.";

/* Tab: Done */
"Text Congrats" = "الوسائط جاهزة. يمكنك الآن إزالتها من نظامك واستخدامها لاستعادة بيانات جهاز نظام تشغيل Chrome.";

/* Sizes */
"Size Bytes" = " بايت";
"Size Kilobytes" = " كيلوبايت";
"Size Megabytes" = " ميغابايت";
"Size Gigabytes" = " غيغابايت";
"Size Terabytes" = " تيرابايت";
"Size Petabytes" = " بيتابايت";

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "لا يمكن تشغيل هذا التطبيق.";
"NoDiskArb Informative" = "حدثت مشكلة أثناء بدء تشغيل Disk Arbitration. كان من المفترض ألا يحدث ذلك.";
"NoDiskArb OK" = "موافق";

/* Error retrieving config file. */
"CantGetConfig Message" = "لا يمكن استرداد قائمة الصور.";
"CantGetConfig Informative" = "حدثت مشكلة أثناء استرداد قائمة صور الاسترداد المتاحة (%1$@). الرجاء التحقق للتأكد من سلامة اتصال الشبكة.";
"CantGetConfig OK" = "موافق";
"CantGetConfig Error NoConnection" = "اتصال لا يمكن تحديده";
"CantGetConfig Error DownloadError" = "حدث خطأ أثناء التنزيل";
"CantGetConfig Error StringCreate" = "تعذر استخدام الرد";

/* Version error. */
"VersionError Message" = "هذا الإصدار من التطبيق قديم جدًا.";
"VersionError Informative" = "الرجاء تنزيل إصدار أحدث. هذا هو الإصدار %1$@; وعلى الأقل يلزم استخدام الإصدار %2$@. %3$@";
"VersionError OK" = "الحصول على إصدار جديد";

/* File dialog to select a local file. */
"SelectLocal File" = "يرجى تحديد صورة:";
"SelectLocal Button" = "تحديد";

/* Alert on writing stick. */
"WriteAlert Message" = "هل تريد بالتأكيد مسح %1$@ نهائيًا؟";
"WriteAlert Informative" = "سيتم فقد جميع البيانات الموجودة به حاليًا بشكل نهائي. لا يمكنك التراجع عن هذا الإجراء.";
"WriteAlert Cancel" = "عدم المسح";
"WriteAlert OK" = "مسح";

"TooSmallAlert Message" = "لا يمكن استخدام %1$@؛ حجم رقاقة USB أصغر مما يجب.";
"TooSmallAlert Informative" = "يلزم استخدام بطاقة SD أو رقاقة ذاكرة USB لا تقل سعتها عن %2$@.";
"TooSmallAlert OK" = "موافق";

"NotWritable Message" = "لا يمكن استخدام %1$@; إنها للقراءة فقط.";
"NotWritable Informative" = "بطاقة SD أو رقاقة ذاكرة USB مخصصة للقراءة فقط. ربما يكون هناك مفتاح تبديل عليها لتمكين وضع الكتابة عليها؛ فإذا لم يكن موجودًا، فلا يمكن استخدامها.";
"NotWritable OK" = "موافق";

"Label SD Card" = "بطاقة SD";

/* Stick writing statuses. */
"Status Downloading" = "جارٍ التنزيل…";
"Status Verifying Image" = "جارٍ التحقق من نسخة الاسترداد…";
"Status Unpacking" = "جارٍ فك الضغط…";
"Status Claiming" = "جارٍ المطالبة…";
"Status Unmounting" = "جارٍ إزالة التحميل…";
"Status Writing" = "جارٍ الكتابة…";
"Status Verifying Media" = "جارٍ التحقق من وسائط الاسترداد…";
"Status Ejecting" = "جارٍ الإخراج…";
"Status Done" = "تم!";

"StatusAdd Attempt" = " (المحاولة %1$d)";

/* Errors */
"Failure Downloading" = "عذرًا، حدث خطأ (أخفق تنزيل صورة المصدر). هل تريد إعادة المحاولة؟";
"Failure Verifying Return Value" = "عذرًا، حدث خطأ (أخفق التحقق من صورة المصدر، وأخفق البرنامج %1$s). هل تريد إعادة المحاولة؟";
"Failure Verifying SHA Mismatch" = "عذرًا، حدث خطأ (أخفق التحقق من صورة المصدر، وأخفق الاختبار المجمع). هل تريد إعادة المحاولة؟";
"Failure Unpacking" = "عذرًا، حدث خطأ (أخفق فك ضغط صورة المصدر، %1$s). هل تريد إعادة المحاولة؟";
"Failure Claiming" = "عذرًا، حدث خطأ (أخفقت المطالبة برقاقة USB). هل تريد إعادة المحاولة؟";
"Failure Unmounting" = "عذرًا، حدث خطأ (أخفق فك ضغط رقاقة USB). هل تريد إعادة المحاولة؟";
"Failure Opening Source Image" = "عذرًا، حدث خطأ (أخفق فتح صورة المصدر، %1$s). هل تريد إعادة المحاولة؟";
"Failure Opening Destination Device" = "عذرًا، حدث خطأ (أخفق فتح رقاقة USB، %1$s). هل تريد إعادة المحاولة؟";
"Failure Reading Source Image" = "عذرًا، حدث خطأ (أخفقت قراءة صورة المصدر، %1$s). هل تريد إعادة المحاولة؟";
"Failure Writing Destination Device" = "عذرًا، حدث خطأ (أخفقت كتابة البيانات على رقاقة USB، %1$s). هل تريد إعادة المحاولة؟";
"Failure Reading Destination Device" = "عذرًا، حدث خطأ (أخفقت القراءة من رقاقة USB، %1$s). هل تريد المحاولة مرة أخرى؟";
"Failure Resetting Source Image" = "عذرًا، حدث خطأ (أخفق ترجيع صورة المصدر، %1$s). هل تريد المحاولة مرة أخرى؟";
"Failure Resetting Destination Device" = "عذرًا، حدث خطأ (أخفق ترجيع رقاقة USB، %1$s). هل تريد المحاولة مرة أخرى؟";
"Failure Ejecting" = "عذرًا، حدث خطأ (أخفق إخراج رقاقة USB). هل تريد إعادة المحاولة؟";

"Failure Try Again" = "إعادة المحاولة";
"Failure Quit" = "إنهاء";

"Failure Termination Status" = "حالة الإنهاء %d";

"Failure Internal Error 1" = "نهاية ملف غير متوقعة";
